
<!DOCTYPE HTML>
<html lang="zh-tw" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>前言 · yrhhiming</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="jacob">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-advanced-emoji/emoji-website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-emphasize/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-intopic-toc/style.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-insert-logo/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="styles/website.css">
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="article/story1.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="輸入並搜尋" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="article/story1.html">
            
                <a href="article/story1.html">
            
                    
                    最近一次的專案
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="article/story2.html">
            
                <a href="article/story2.html">
            
                    
                    後台
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="article/story3.html">
            
                <a href="article/story3.html">
            
                    
                    前台
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="article/story4.md">
            
                <span>
            
                    
                    攻擊與防守
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="article/code1.html">
            
                <a href="article/code1.html">
            
                    
                    應用範例
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="article/code2.html">
            
                <a href="article/code2.html">
            
                    
                    在CentOS
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="article/code3.html">
            
                <a href="article/code3.html">
            
                    
                    在Docker
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="article/about.html">
            
                <a href="article/about.html">
            
                    
                    個人資訊
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本書使用 GitBook 釋出
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >前言</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x9019;&#x88E1;&#x662F;&#x4E00;&#x500B;&#x4ECB;&#x7D39;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x5730;&#x65B9;">&#x9019;&#x88E1;&#x662F;&#x4E00;&#x500B;&#x4ECB;&#x7D39;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x5730;&#x65B9;</h2>
<p><img src="../imgs/IMG_home1.jpg" alt="hi"></p>
<p>&#x6211;&#x662F;&#x4E00;&#x500B;&#x4E0D;&#x65B7;&#x5B78;&#x7FD2;&#x6210;&#x9577;&#x7684;&#x8CC7;&#x6DF1;&#x7A0B;&#x5E8F;&#x733F;&#x3002;&#x4E0A;&#x5716;&#x662F;&#x53F0;&#x7063;&#x53F0;&#x6771;&#x7684;&#x592A;&#x9EBB;&#x88E1;&#x5C71;&#x4E0A;&#xFF0C;&#x662F;&#x6211;&#x51FA;&#x751F;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<h4 id="&#x555F;&#x8499;">&#x555F;&#x8499;</h4>
<p>&#x5B78;&#x751F;&#x6642;&#x671F;&#x63A5;&#x89F8;&#x4E86; DOS &#x5F8C;&#xFF0C;&#x5F9E;&#x6B64;&#x5C0D;&#x96FB;&#x8166;&#x7522;&#x751F;&#x4E86;&#x8208;&#x8DA3;&#x3002;&#x9084;&#x8A18;&#x5F97;&#x7B2C;&#x4E00;&#x6B21;&#x5B78;&#x7FD2;&#x7684;&#x662F;C&#xFF0C;COBOL&#xFF0C;Basic&#xFF0C;&#x7576;&#x6642;&#x53EA;&#x77E5;&#x9053; C &#x662F;&#x9700;&#x8981;&#x914D;&#x5408;&#x786C;&#x9AD4;&#x958B;&#x767C;&#xFF0C;COBOL &#x662F;&#x5C08;&#x9580;&#x5E6B;&#x9280;&#x884C;&#x5BEB;&#x5831;&#x8868;&#x7528;&#xFF0C;Basic&#x5B8C;&#x5168;&#x662F;&#x5B78;&#x8208;&#x8DA3;&#x7684;&#x3002;C&#x96D6;&#x7136;&#x5B78;&#x7684;&#x4E0D;&#x932F;&#xFF0C;&#x4F46;&#x5BE6;&#x5728;&#x4E0D;&#x77E5;&#x9053;&#x8981;&#x7528;&#x5728;&#x4EC0;&#x9EBC;&#x5730;&#x65B9;&#xFF0C;&#x540C;&#x6642;&#x5B78;&#x7FD2;COBOL&#x7576;&#x4E0B;&#xFF0C;&#x5C07;&#x71DF;&#x76EE;&#x63A7;&#x5236;&#x7684;&#x90E8;&#x5206;&#x62FF;&#x4F86;&#x5BEB;&#x50CF;&#x8CAA;&#x98DF;&#x86C7;&#x7684;&#x5C0F;&#x7A0B;&#x5E8F;&#xFF0C;&#x7562;&#x7ADF;&#x7522;&#x5831;&#x8868;&#x5C0D;&#x5B78;&#x751F;&#x7684;&#x6211;&#x4F86;&#x8AAA;&#x5BE6;&#x5728;&#x592A;&#x67AF;&#x71E5;&#x3002; </p>
<p>&#x5728;&#x5B78;&#x751F;&#x5F8C;&#x671F;&#xFF0C;&#x5FAE;&#x8EDF;&#x51FA;&#x4E86;&#x4E00;&#x6B3E; Visual Studio 97&#xFF0C; &#x88E1;&#x9762;&#x5305;&#x542B;&#x4E86;VB 5&#xFF0C; VC &#x8207; FoxPro&#xFF0C;&#x5728;&#x96E3;&#x6613;&#x5EA6;&#x4E0A; VB &#x662F;&#x6700;&#x6613;&#x4E0A;&#x624B;&#x7684;&#xFF0C; &#x9019;&#x4E5F;&#x662F;&#x7576;&#x6642;&#x6211;&#x80FD;&#x552F;&#x4E00;&#x80FD;&#x62FF;&#x7684;&#x51FA;&#x624B;&#x5403;&#x98EF;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x7A0B;&#x5E8F;&#x5BEB;&#x5230;&#x6700;&#x5F8C;&#x5E7E;&#x4E4E;&#x90FD;&#x5728;&#x547C;&#x53EB; Windows API&#xFF0C;&#x96E2;&#x6A19;&#x6E96;&#x8A9E;&#x6CD5;&#x5DF2;&#x7D93;&#x5F88;&#x9060;&#x4E86;&#x3002;</p>
<h4 id="&#x7B2C;&#x4E00;&#x6B21;&#x63A5;&#x89F8;&#x517C;&#x6848;">&#x7B2C;&#x4E00;&#x6B21;&#x63A5;&#x89F8;&#x517C;&#x6848;</h4>
<p>&#x5B78;&#x7FD2;&#x7A0B;&#x5E8F;&#x5F8C;&#xFF0C;&#x5C31;&#x4E00;&#x76F4;&#x60F3;&#x5370;&#x8A3C;&#x81EA;&#x5DF1;&#x7684;&#x6240;&#x5B78;&#xFF0C;&#x80FD;&#x4E0D;&#x80FD;&#x904B;&#x7528;&#x5728;&#x5E02;&#x5834;&#x4E0A;&#xFF0C;&#x7576;Y2K&#x5371;&#x6A5F;&#x9020;&#x5C31;&#x5E02;&#x5834;&#x5927;&#x91CF;&#x6C71;&#x9664;&#x9ED1;&#x767D;&#x8EDF;&#x4EF6;&#xFF0C;&#x5546;&#x5BB6;&#x90FD;&#x5728;&#x3777;&#x627E;&#x65B0;&#x7684;&#x89E3;&#x6C7A;&#x65B9;&#x6848;&#xFF0C;&#x5E02;&#x5834;&#x662F;&#x4E00;&#x7247;&#x7F8E;&#x597D;&#x3002;&#x9019;&#x6642;&#x5E74;&#x9577;&#x53CB;&#x4EBA;&#xFF0C;&#x6210;&#x7ACB;&#x4E86;&#x4E00;&#x9593;&#x500B;&#x4EBA;&#x96FB;&#x8166;&#x8A2D;&#x5099;&#x7DAD;&#x8B77;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x4E3B;&#x8981;&#x696D;&#x52D9;&#x662F;&#x6E05;&#x6F54;&#x500B;&#x4EBA;&#x96FB;&#x8166;&#xFF1F;&#xFF1F; &#x6211;&#x7576;&#x6642;&#x4E00;&#x76F4;&#x61F7;&#x7591;&#x516C;&#x53F8;&#x80FD;&#x5426;&#x904B;&#x4F5C;&#xFF1F;&#x9019;&#x9593;&#x516C;&#x53F8;&#x96A8;&#x5F8C;&#x9806;&#x5229;&#x7D93;&#x71DF;&#xFF0C;&#x767C;&#x5C55;&#x4E0A;&#x4E5F;&#x70BA;&#x4E86;&#x8EDF;&#x786C;&#x4E8C;&#x5403;&#xFF0C;&#x65BC;&#x662F;&#x627E;&#x6211;&#x9019;&#x500B;&#x5EC9;&#x50F9;&#x5B78;&#x751F;&#x7A0B;&#x5E8F;&#x54E1;&#x4F86;&#x5408;&#x4F5C;&#x3002;&#x7B2C;&#x4E00;&#x6848;&#x7684;&#x6848;&#x4E3B;&#x662F;&#x505A;&#x6C34;&#x96FB;&#x4E2D;&#x76E4;&#xFF0C;&#x8981;&#x505A;&#x5BA2;&#x88FD;&#x7684;&#x7BA1;&#x92B7;&#x8EDF;&#x4EF6;&#x3002;&#x7576;&#x6642;&#x6211;&#x662F;&#x500B;&#x5B78;&#x751F;&#xFF0C;&#x5F9E;&#x4F86;&#x6C92;&#x6709;&#x807D;&#x904E;&#x90A3;&#x9EBC;&#x5927;&#x984D;&#x5EA6;&#x7684;&#x9810;&#x7B97;&#x6848;&#xFF0C;&#x5FC3;&#x4E2D;&#x8457;&#x5BE6;&#x7684;&#x9707;&#x9A5A;&#x60F6;&#x6050;&#xFF0C;&#x7D93;&#x904E;&#x8A2A;&#x8AC7;&#x601D;&#x8003;&#x5F8C;&#xFF0C;&#x6211;&#x81EA;&#x8A8D;&#x80FD;&#x529B;&#x4E0D;&#x8DB3;&#x653E;&#x68C4;&#x4E86;&#x3002;</p>
<h4 id="com">.com</h4>
<p>.com &#x7684;&#x8208;&#x8D77;&#xFF0C;&#x518D;&#x6B21;&#x628A;&#x5340;&#x7DB2;&#x5C01;&#x9589;&#x7684;&#x74B0;&#x5883;&#x64CA;&#x6F70;&#xFF0C;&#x6539;&#x671D;&#x63DB;&#x4EE3;&#x5F8C; Novell &#x958B;&#x59CB;&#x8D70;&#x5411;&#x8870;&#x6557;&#xFF0C;Windows &#x8207; Linux &#x5927;&#x91CF;&#x53D6;&#x4EE3;&#xFF0C;&#x9019;&#x6642; Web &#x51FA;&#x73FE;&#xFF0C;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;AP&#x7684;&#x5E02;&#x5834;&#x4E5F;&#x958B;&#x59CB;&#x6D88;&#x5931;&#xFF0C; &#x540C;&#x671F;&#x9593;&#x5E02;&#x9762;&#x8208;&#x8D77;&#x7A3F;&#x672C;&#x8A9E;&#x8A00;&#xFF0C;&#x5728;&#x5DE5;&#x5177;&#x4E2D;&#x6211;&#x9078;&#x64C7;&#x4E86; asp , php &#x4F5C;&#x70BA;&#x958B;&#x767C;&#x5DE5;&#x5177;&#xFF0C;&#x4E5F;&#x78BA;&#x5BE6;&#x7684;&#x61C9;&#x7528;&#x5728;&#x8077;&#x5834;&#x8207;&#x517C;&#x6848;&#x4E0A;&#xFF0C;&#x96A8;&#x8457;&#x4E0D;&#x540C;&#x9700;&#x6C42;&#xFF0C;&#x4E5F;&#x9047;&#x904E;&#x5F88;&#x591A;&#x5947;&#x5947;&#x602A;&#x602A;&#x7684;&#x6574;&#x5408;&#x624B;&#x6CD5;&#xFF0C;&#x7576;&#x6642;&#x7DB2;&#x8DEF;&#x67E5;&#x8A62;&#x8CC7;&#x6E90;&#x6709;&#x9650;&#xFF0C;&#x6280;&#x6CD5;&#x901A;&#x5E38;&#x662F;&#x500B;&#x4EBA;&#x79C1;&#x85CF;&#x8F03;&#x591A;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x8AB0;&#x6BD4;&#x8F03;&#x6709;&#x512A;&#x52E2;&#x4E00;&#x6A23;&#xFF1F; &#x7576;&#x7136;&#x7528;&#x5728;&#x73FE;&#x5728;&#x7684;&#x74B0;&#x5883;&#xFF0C;&#x9673;&#x820A;&#x7684;&#x6280;&#x80FD;&#x76F8;&#x5C0D;&#x7684;&#x4E5F;&#x662F;&#x4E00;&#x7A2E;&#x8CA0;&#x8CC7;&#x7522;&#x3002; </p>
<h4 id="&#x7DB2;&#x62CD;">&#x7DB2;&#x62CD;</h4>
<p>B2B&#xFF0C;B2C&#x76DB;&#x884C;&#x4E0B;&#xFF0C;&#x7DB2;&#x62CD;&#x8CFC;&#x7269;&#x4E5F;&#x6210;&#x70BA;&#x6700;&#x53D7;&#x89C0;&#x6CE8;&#x7684;&#x9805;&#x76EE;&#x3002;VS &#x5DE5;&#x5177;&#x9032;&#x7248;&#x5230; .Net &#x4F86;&#x901A;&#x5403;&#x9019;&#x5546;&#x696D;&#x6A21;&#x5F0F;&#xFF0C;&#x96A8;&#x4E4B;&#x6211;&#x4E5F;&#x9032;&#x7248;&#x4E86; .Net C# &#x8207; ASP.Net Form &#x4F5C;&#x70BA;&#x4E3B;&#x8981;&#x958B;&#x767C;&#x5DE5;&#x5177;&#x3002;&#x6162;&#x6162;&#x7684;&#x56E0;&#x70BA;&#x63A5;&#x89F8;&#x5230;&#x5C0F;&#x5546;&#x5BB6;&#xFF0C;&#x5728;&#x6210;&#x672C;&#x6709;&#x9650;&#x7684;&#x60C5;&#x6CC1;&#x4E0B;&#xFF0C;&#x958B;&#x767C;&#x6210;&#x672C;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x8003;&#x91CF;&#xFF0C;&#x9762;&#x5C0D;&#x696D;&#x4E3B;&#xFF0C;&#x6211;&#x6703;&#x9078;&#x64C7; php &#x7684;&#x96F2;&#x65B9;&#x6848;&#x4F86;&#x7BC0;&#x7701;&#x6210;&#x672C;&#xFF0C;&#x540C;&#x6642;&#x9593;&#x4E5F;&#x6F38;&#x6F38;&#x7684;&#x89BA;&#x5F97;&#xFF0C;&#x5FAE;&#x8EDF;&#x7684;&#x6388;&#x6B0A;&#x8CBB;&#x8CB4;&#x5230;&#x96E3;&#x4EE5;&#x627F;&#x53D7;&#xFF0C;&#x514D;&#x8CBB;&#x7684;&#x958B;&#x6E90;&#x74B0;&#x5883;&#xFF0C;&#x5C07;&#x6703;&#x662F;&#x672A;&#x4F86;&#x7684;&#x8DA8;&#x52E2;&#x3002;</p>
<h4 id="database">Database</h4>
<p>&#x8AC7;&#x5230;&#x5546;&#x696D;&#x61C9;&#x7528;&#x7A0B;&#x5F0F;&#x958B;&#x767C;&#xFF0C;&#x5FC5;&#x7136;&#x6703;&#x8AAA;&#x5230;&#x5132;&#x5B58;&#x88DD;&#x7F6E;&#x3002;&#x8EAB;&#x70BA;&#x5FAE;&#x8EDF;&#x9663;&#x71DF;&#x7684;&#x6211;&#xFF0C;MSSQL &#x7576;&#x7136;&#x662F;&#x5FC5;&#x5099;&#x9805;&#x76EE;&#x3002;&#x4F46;&#x5728;&#x500B;&#x4EBA;&#x7ACB;&#x5834;&#x4E0A;&#xFF0C;&#x6700;&#x5F8C;&#x4E5F;&#x5F88;&#x5C11;&#x518D;&#x4F7F;&#x7528;&#xFF0C;&#x539F;&#x56E0;&#x4E5F;&#x662F;&#x56E0;&#x70BA;&#x904E;&#x65BC;&#x6602;&#x8CB4;&#x3002;&#x500B;&#x4EBA;&#x9078;&#x64C7;&#x4E0A;&#x504F;&#x597D; mySQL&#xFF0C;&#x4E00;&#x8DEF;&#x770B;&#x8457;&#x5B83;&#x88AB;&#x6536;&#x8CFC;&#x5F8C;&#x5206;&#x5BB6;&#x6210;&#x53E6;&#x4E00;&#x500B;&#x793E;&#x7FA4;&#x7248;&#x672C; mariadb&#xFF0C;&#x76F4;&#x81F3;&#x4ECA;&#xFF0C;&#x5B83;&#x4ECD;&#x7D93;&#x7684;&#x8D77;&#x8003;&#x9A57;&#xFF0C;&#x5373;&#x4FBF;&#x662F; NoSQL&#x8207; &#x5BE6;&#x6642;&#x8CC7;&#x6599;&#x5EAB;(&#x4F8B;&#x5982;&#xFF1A;Firebase) &#x7684;&#x51FA;&#x73FE;&#xFF0C;&#x4F9D;&#x820A;&#x5C0D;&#x5B83;&#x6C92;&#x6709;&#x5F71;&#x97FF;&#xFF0C;&#x5728;&#x6211;&#x500B;&#x4EBA;&#x7D93;&#x9A57;&#x4E0A;&#x5373;&#x4FBF;&#x662F;&#x5927;&#x91CF;&#x8CC7;&#x6599; I/O &#x8207;&#x5E73;&#x8861;&#x8CA0;&#x8F09;&#x4E5F;&#x662F;&#x5F88;&#x96B1;&#x5B9A;&#x3002;</p>
<h4 id="mvc-&#x8207;-git">MVC &#x8207; Git</h4>
<p>&#x8EDF;&#x9AD4;&#x767C;&#x5C55;&#x81F3;&#x6B64;&#xFF0C;&#x958B;&#x59CB;&#x6709;&#x4E86;&#x8A2D;&#x8A08;&#x6A21;&#x5F0F;&#x7684;&#x8A0E;&#x8AD6;&#xFF0C;&#x4F86;&#x7D71;&#x4E00;&#x7D1B;&#x4E82;&#x7684;&#x8A2D;&#x8A08;&#x6A19;&#x6E96;&#xFF0C;&#x4E5F;&#x5C31;&#x662F; MVC / MVVM &#x9019;&#x6A23;&#x7684;&#x67B6;&#x69CB;&#x51FA;&#x73FE;&#xFF0C;&#x7528;&#x4F86;&#x6A19;&#x6E96;&#x5316;&#x958B;&#x767C;&#x6A21;&#x5F0F;&#xFF0C;&#x66F4;&#x5BB9;&#x6613;&#x7684;&#x5206;&#x5DE5;&#x5408;&#x4F5C;&#xFF0C;&#x5718;&#x968A;&#x6253;&#x67B6;&#x7E3D;&#x662F;&#x52DD;&#x904E;&#x55AE;&#x5175;&#x4F5C;&#x6230;&#xFF0C;&#x6709;&#x4E86;&#x7D71;&#x4E00;&#x6A19;&#x6E96;&#xFF0C;&#x624D;&#x80FD;&#x66F4;&#x5FEB;&#x7684;&#x878D;&#x5165;&#x5225;&#x4EBA;&#x3002;&#x63A7;&#x7248;&#x7684;&#x4F7F;&#x7528;&#x4E0A;&#x4E5F;&#x5F9E;&#x65E9;&#x671F;&#x7684; SVN&#xFF0C;Team Foundation&#xFF0C;&#x4E00;&#x8DEF;&#x8D70;&#x5230; Git&#x3002;</p>
<h4 id="javascript">JavaScript</h4>
<p>&#x958B;&#x767C;&#x6210;&#x672C;&#x59CB;&#x7D42;&#x662F;&#x696D;&#x4E3B;&#x8207;&#x8001;&#x95C6;&#x7684;&#x8003;&#x91CF;&#xFF0C;Linux &#x7684;&#x8D70;&#x5411;&#x52E2;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#xFF0C;&#x6211;&#x4E5F;&#x5F9E; Windows &#x8D70;&#x5411; Mac&#xFF0C;&#x4F3A;&#x670D;&#x5668;&#x4E0A;&#x9078;&#x64C7;&#x4E86; CentOS &#x61C9;&#x7528;&#xFF0C;&#x76F8;&#x95DC;&#x7684;&#x67B6;&#x8A2D;&#x4E5F;&#x662F;&#x4E00;&#x6B65;&#x4E00;&#x8173;&#x5370;&#x7684;&#x8D70;&#x4F86;&#xFF0C;&#x5DE5;&#x5177;&#x6539;&#x70BA; ASP.Net Core &#x4F48;&#x7F72;&#x5728; Linux &#x7684; Nginx &#x4E0A;&#xFF0C;&#x76EE;&#x524D;&#x7684;&#x8DA8;&#x52E2;&#x662F;&#x524D;&#x7AEF;&#x5DE5;&#x5177;&#x51CC;&#x67B6;&#x5728;&#x5F8C;&#x7AEF;&#x5DE5;&#x5177;&#x4E4B;&#x4E0A;&#xFF0C;&#x5F62;&#x6210;&#x4E86;&#x5404;&#x9805;&#x767C;&#x5C55;&#x3002;&#x5F9E; jQuery / Bootstrap&#xFF0C;&#x767C;&#x5C55;&#x5230; Recat / Angular / Vue &#x7684;&#x51FA;&#x73FE;&#xFF0C;&#x6253;&#x5305;&#x5DE5;&#x5177;&#x66F4;&#x662F;&#x591A;&#x4E0D;&#x52DD;&#x6578;&#x3002;</p>
<h4 id="devops">DevOps</h4>
<p>&#x8FD1;&#x5E74;&#x4F86;&#x6211;&#x624D;&#x77E5;&#x9053;&#xFF0C;&#x4EE5;&#x524D;&#x6642;&#x5E38;&#x81EA;&#x5DF1;&#x6253;&#x5305; &#x524D;&#x7AEF;&#xFF0C;&#x5F8C;&#x7AEF;&#xFF0C;&#x8CC7;&#x6599;&#x5132;&#x5B58;&#xFF0C;&#x67B6;&#x8A2D;&#x7DAD;&#x8B77;&#x8207;&#x81EA;&#x52D5;&#x4F48;&#x7F72;&#xFF0C;&#x9019;&#x4E9B;&#x884C;&#x70BA;&#x7D71;&#x7A31;&#x70BA;&#xFF1A;DevOps&#xFF0C;&#x5728;&#x73FE;&#x5728;&#x66F4;&#x6709; DevOps&#x8A8D;&#x8A3C;&#x4E86;&#x3002;&#x5728;&#x67B6;&#x8A2D;&#x74B0;&#x5883;&#x6642;&#xFF0C;linux &#x6838;&#x5FC3;&#x7684;&#x65B9;&#x5F0F;&#x4E0D;&#x5920;&#x5F48;&#x6027;&#x5E38;&#x8B93;&#x4EBA;&#x611F;&#x89BA;&#x4E0D;&#x65B9;&#x4FBF;&#xFF0C;&#x65BC;&#x662F;&#x5728;VisualBox&#x5F8C;&#x51FA;&#x73FE;&#x7684; Docker &#x80FD;&#x5728;&#x7121;&#x6838;&#x5FC3;&#x4E0B;&#xFF0C;&#x81EA;&#x7531;&#x639B;&#x8F09;&#x7D44;&#x5408;&#x81EA;&#x5DF1;&#x9700;&#x8981;&#x7684;&#x958B;&#x767C;&#x74B0;&#x5883;&#xFF0C;&#x4E0D;&#x7528;&#x9867;&#x53CA;&#x7CFB;&#x7D71;&#x7684;&#x5168;&#x9762;&#xFF0C;&#x65B9;&#x4FBF;&#x53C8;&#x597D;&#x629B;&#x68C4;&#xFF0C;&#x975E;&#x5E38;&#x7684;&#x5BE6;&#x7528;&#x3002;</p>
<h4 id="&#x672A;&#x4F86;">&#x672A;&#x4F86;</h4>
<p>&#x96FB;&#x8166;&#x81EA;&#x5B78;&#x4E00;&#x76F4;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x8208;&#x8DA3;&#xFF0C;&#x5728;&#x9019;&#x689D;&#x8DEF;&#x4E0A;&#x6211;&#x4E00;&#x76F4;&#x7684;&#x5411;&#x524D;&#x9032;&#xFF0C;&#x6C92;&#x6709;&#x505C;&#x4E0B;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="article/story1.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 最近一次的專案">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"前言","level":"1.1","depth":1,"next":{"title":"最近一次的專案","level":"1.2","depth":1,"path":"article/story1.md","ref":"article/story1.md","articles":[{"title":"後台","level":"1.2.1","depth":2,"path":"article/story2.md","ref":"article/story2.md","articles":[]},{"title":"前台","level":"1.2.2","depth":2,"path":"article/story3.md","ref":"article/story3.md","articles":[]},{"title":"攻擊與防守","level":"1.2.3","depth":2,"path":"article/story4.md","ref":"article/story4.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["search-pro","back-to-top-button","chapter-fold","advanced-emoji","splitter","emphasize","custom-favicon","intopic-toc","hide-element","insert-logo"],"styles":{"website":"styles/website.css"},"pluginsConfig":{"chapter-fold":{},"emphasize":{},"intopic-toc":{"isCollapsed":false,"isScrollspyActive":true,"label":"章節","maxDepth":2,"mode":"nested","selector":".markdown-section h1, .markdown-section h2, .markdown-section h3, .markdown-section h4, .markdown-section h5, .markdown-section h6","visible":true},"splitter":{},"search-pro":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"favicon":"imgs/me.ico","back-to-top-button":{},"custom-favicon":{},"advanced-emoji":{"embedEmojis":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"insert-logo":{"style":"background: none;border:1px solid #eee;","url":"./imgs/ico.png"}},"theme":"default","author":"jacob","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"yrhhiming","language":"zh-tw","gitbook":"*","description":"程式心得說明"},"file":{"path":"README.md","mtime":"2022-05-27T17:56:56.342Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-05-27T18:09:03.768Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/anchor.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/gumshoe.polyfills.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-insert-logo/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

